#+TITLE: OrgMode Reference

- Manuals: https://orgmode.org/manuals.html
- [[https://www.youtube.com/watch?v=SzA2YODtgK4][Getting Started With Org Mode]] (YouTube presentation)
- https://gist.github.com/drj42/1755992 (Keybinding Cheatsheet)

** Source code

  | Shortcut | Action                              |
  |----------+-------------------------------------|
  | <s + TAB | quickly insert source code block    |
  | C-c '    | edit source block in specified mode |
  | C-c      | exit edit mode and return to org    |
  | C-c C-c  | evaluate source block               |

#+begin_src java
for (int i=0; i<5; i++) {
    System.out.println("Counting "+i);
}
#+end_src

#+RESULTS:
: Counting 0
: Counting 1
: Counting 2
: Counting 3
: Counting 4

Inline src_clojure{ (defn square [x] (* x x)) } source code.


